Revit 2027 API
IFCAnyHandle.SetAttribute(String, ISet<Boolean>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	ISet<bool> values
)
Public Sub SetAttribute (
	name As String,
	values As ISet(Of Boolean)
)
public:
void SetAttribute(
	String^ name,
	ISet<bool>^ values
)
member SetAttribute :
        name : string *
        values : ISet<bool> -> unit
Parameters
name String
values ISet<Boolean>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace